slides/aula01/aula01.org
#+OPTIONS: num:nil toc:nil
#+OPTIONS: date:nil reveal_mathjax:t
#+OPTIONS: tex t
#+OPTIONS: timestamp:nil
#+OPTIONS: org-confirm-babel-evaluate nil
#+REVEAL_THEME: white
#+REVEAL_HLEVEL: 1
#+REVEAL_ROOT: file:../reveal.js

#+Title: Um Compilador Simples
#+Author: Construção de compiladores I

* Objetivos

** Objetivos

- Apresentar a especificação léxica e sintática de uma linguagem simples.

- Apresentar a implementação completa de um compilador para uma linguagem simples de expressões.

* Expressões Aritméticas

** Expressões Aritméticas

- Especificação léxica
  - Números: digit+
  - Operadores e separadores: +, *, (, )

** Expressões Aritméticas

- Especificação sintática

\begin{array}{lcl}
   e & \to & n \,|\, e + e \,|\, e * e \,|\, (e)
\end{array}

** Expressões Aritméticas

- De posse da gramática, vamos considerar as diferentes etapas do compilador. 
  - Análise léxica 
  - Análise sintática 
  - Intepretador 
  - Geração de código 

* Análise léxica 

** Análise léxica

- Primeira etapa do front-end de um compilador.
- Simplificar a entrada para análise sintática.

** Análise léxica

- Simplificações:
  - Remoção de espaços em branco.
  - Remoção de comentários.

- Resultado: lista de **tokens**.

** Análise léxica

- Token
  - Componente indivisível da sintaxe de uma linguagem.
- Exemplos:
  - identificadores
  - palavras reservadas
  - separadores
  - literais

** Análise léxica

- Como implementar a análise léxica?

** Análise léxica ad-hoc

- Percorra a string:
  - Se for um dígito, guarde-o para formar um número.
  - Se for um operador, gere o token.
  - Se for um parêntesis, gere o token.
  - Se for um espaço, tente gerar um número e descarte o espaço.

** Análise léxica ad-hoc

- Como representar tokens?
  - Primeiro, definimos seus tipos: lexemas.

#+begin_src haskell
data Lexeme  
  = TNumber Value  
  | TPlus 
  | TMul
  | TLParen
  | TRParen 
#+end_src

** Análise léxica ad-hoc 

- Token = lexema + posição

#+begin_src haskell
data Token 
  = Token {
      lexeme :: Lexeme
    , position :: (Int, Int)
    } 
#+end_src

** Análise léxica ad-hoc

- Configuração do analisador léxico
  - Linha e coluna atual.
  - String de dígitos consecutivos encontrados.
  - Lista de tokens encontrados. 

#+begin_src haskell
type Line = Int 
type Column = Int
type State = (Line, Column, String, [Token])
#+end_src

** Análise léxica ad-hoc

- Transição de estado sob um caractere

#+begin_src haskell
transition :: State -> Char -> Either String State
transition state@(l, col, t, ts) c 
  | c == '\n' = mkDigits state c 
  | isSpace c = mkDigits state c 
  | c == '+' = Right ( l, col + 1, ""
                     , mkToken state (Token TPlus (l,col)) ++ ts)
  | isDigit c = Right (l, col + 1, c : t, ts)
  | otherwise = unexpectedCharError l col c 
#+end_src

