slides/aula01/aula01.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Um Compilador Simples</title>
<meta name="author" content="Construção de compiladores I"/>
<link rel="stylesheet" href="file:../reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="file:../reveal.js/dist/theme/white.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Um Compilador Simples</h1><h2 class="author">Construção de compiladores I</h2>
</section>
<section>
<section id="slide-orgb70edc2">
<h2 id="orgb70edc2">Objetivos</h2>
<div class="outline-text-2" id="text-orgb70edc2">
</div>
</section>
<section id="slide-org666a65b">
<h3 id="org666a65b">Objetivos</h3>
<ul>
<li>Apresentar a especificação léxica e sintática de uma linguagem simples.</li>

<li>Apresentar a implementação completa de um compilador para uma linguagem simples de expressões.</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd789bf0">
<h2 id="orgd789bf0">Expressões Aritméticas</h2>
<div class="outline-text-2" id="text-orgd789bf0">
</div>
</section>
<section id="slide-org20a1c43">
<h3 id="org20a1c43">Expressões Aritméticas</h3>
<ul>
<li>Especificação léxica
<ul>
<li>Números: digit+</li>
<li>Operadores e separadores: +, *, (, )</li>

</ul></li>

</ul>
</section>
<section id="slide-orgec96ac3">
<h3 id="orgec96ac3">Expressões Aritméticas</h3>
<ul>
<li>Especificação sintática</li>

</ul>

<div>
\begin{array}{lcl}
   e & \to & n \,|\, e + e \,|\, e * e \,|\, (e)
\end{array}

</div>
</section>
<section id="slide-orgfbc5cb0">
<h3 id="orgfbc5cb0">Expressões Aritméticas</h3>
<ul>
<li>De posse da gramática, vamos considerar as diferentes etapas do compilador. 
<ul>
<li>Análise léxica</li>
<li>Análise sintática</li>
<li>Intepretador</li>
<li>Geração de código</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd156f09">
<h2 id="orgd156f09">Análise léxica</h2>
<div class="outline-text-2" id="text-orgd156f09">
</div>
</section>
<section id="slide-org6bfbbb3">
<h3 id="org6bfbbb3">Análise léxica</h3>
<ul>
<li>Primeira etapa do front-end de um compilador.</li>
<li>Simplificar a entrada para análise sintática.</li>

</ul>
</section>
<section id="slide-org8259ec6">
<h3 id="org8259ec6">Análise léxica</h3>
<ul>
<li>Simplificações:
<ul>
<li>Remoção de espaços em branco.</li>
<li>Remoção de comentários.</li>

</ul></li>

<li>Resultado: lista de <b><b>tokens</b></b>.</li>

</ul>
</section>
<section id="slide-orgf750f00">
<h3 id="orgf750f00">Análise léxica</h3>
<ul>
<li>Token
<ul>
<li>Componente indivisível da sintaxe de uma linguagem.</li>

</ul></li>
<li>Exemplos:
<ul>
<li>identificadores</li>
<li>palavras reservadas</li>
<li>separadores</li>
<li>literais</li>

</ul></li>

</ul>
</section>
<section id="slide-orgcddf826">
<h3 id="orgcddf826">Análise léxica</h3>
<ul>
<li>Como implementar a análise léxica?</li>

</ul>
</section>
<section id="slide-org873a18c">
<h3 id="org873a18c">Análise léxica ad-hoc</h3>
<ul>
<li>Percorra a string:
<ul>
<li>Se for um dígito, guarde-o para formar um número.</li>
<li>Se for um operador, gere o token.</li>
<li>Se for um parêntesis, gere o token.</li>
<li>Se for um espaço, tente gerar um número e descarte o espaço.</li>

</ul></li>

</ul>
</section>
<section id="slide-orgdcd290a">
<h3 id="orgdcd290a">Análise léxica ad-hoc</h3>
<ul>
<li>Como representar tokens?
<ul>
<li>Primeiro, definimos seus tipos: lexemas.</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">Lexeme</span>  
  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">TNumber</span> <span style="color: #ECBE7B;">Value</span>  
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">TPlus</span> 
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">TMul</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">TLParen</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">TRParen</span> 
</pre>
</div>
</section>
<section id="slide-org072ad19">
<h3 id="org072ad19">Análise léxica ad-hoc</h3>
<ul>
<li>Token = lexema + posição</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">Token</span> 
  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Token</span> {
      lexeme <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Lexeme</span>
    , position <span style="color: #dcaeea;">::</span> (<span style="color: #ECBE7B;">Int</span>, <span style="color: #ECBE7B;">Int</span>)
    } 
</pre>
</div>
</section>
<section id="slide-org9554c23">
<h3 id="org9554c23">Análise léxica ad-hoc</h3>
<ul>
<li>Configuração do analisador léxico
<ul>
<li>Linha e coluna atual.</li>
<li>String de dígitos consecutivos encontrados.</li>
<li>Lista de tokens encontrados.</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">Line</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Int</span> 
<span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">Column</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">State</span> <span style="color: #dcaeea;">=</span> (<span style="color: #ECBE7B;">Line</span>, <span style="color: #ECBE7B;">Column</span>, <span style="color: #ECBE7B;">String</span>, [<span style="color: #ECBE7B;">Token</span>])
</pre>
</div>
</section>
<section id="slide-orga66b761">
<h3 id="orga66b761">Análise léxica ad-hoc</h3>
<ul>
<li>Transição de estado sob um caractere</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">transition</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">State</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Char</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Either</span> <span style="color: #ECBE7B;">String</span> <span style="color: #ECBE7B;">State</span>
<span style="color: #c678dd;">transition</span> state<span style="color: #dcaeea;">@</span>(l, col, t, ts) c 
  <span style="color: #dcaeea;">|</span> c <span style="color: #dcaeea;">==</span> <span style="color: #98be65;">'\n'</span> <span style="color: #dcaeea;">=</span> mkDigits state c 
  <span style="color: #dcaeea;">|</span> isSpace c <span style="color: #dcaeea;">=</span> mkDigits state c 
  <span style="color: #dcaeea;">|</span> c <span style="color: #dcaeea;">==</span> <span style="color: #98be65;">'+'</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Right</span> ( l, col <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #98be65;">""</span>
                     , mkToken state (<span style="color: #ECBE7B;">Token</span> <span style="color: #ECBE7B;">TPlus</span> (l,col)) <span style="color: #dcaeea;">++</span> ts)
  <span style="color: #dcaeea;">|</span> isDigit c <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Right</span> (l, col <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">1</span>, c <span style="color: #ECBE7B;">:</span> t, ts)
  <span style="color: #dcaeea;">|</span> otherwise <span style="color: #dcaeea;">=</span> unexpectedCharError l col c 
</pre>
</div>
</section>
