slides/aula01/aula01.tex
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Construção de compiladores I}
\date{}
\title{Um Compilador Simples}
\hypersetup{
 pdfauthor={Construção de compiladores I},
 pdftitle={Um Compilador Simples},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.22)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Objetivos}
\label{sec:orgf9eeae1}

\subsection*{Objetivos}
\label{sec:org844caa2}

\begin{itemize}
\item Apresentar a especificação léxica e sintática de uma linguagem simples.

\item Apresentar a implementação completa de um compilador para uma linguagem simples de expressões.
\end{itemize}
\section*{Expressões Aritméticas}
\label{sec:org9c50925}

\subsection*{Expressões Aritméticas}
\label{sec:orgccb6787}

\begin{itemize}
\item Especificação léxica
\begin{itemize}
\item Números: digit+
\item Operadores e separadores: +, *, (, )
\end{itemize}
\end{itemize}
\subsection*{Expressões Aritméticas}
\label{sec:orgf25e423}

\begin{itemize}
\item Especificação sintática
\end{itemize}

\begin{array}{lcl}
   e & \to & n \,|\, e + e \,|\, e * e \,|\, (e)
\end{array}
\subsection*{Expressões Aritméticas}
\label{sec:org44fcfae}

\begin{itemize}
\item De posse da gramática, vamos considerar as diferentes etapas do compilador. 
\begin{itemize}
\item Análise léxica
\item Análise sintática
\item Intepretador
\item Geração de código
\end{itemize}
\end{itemize}
\section*{Análise léxica}
\label{sec:org6a83778}

\subsection*{Análise léxica}
\label{sec:org93b8168}

\begin{itemize}
\item Primeira etapa do front-end de um compilador.
\item Simplificar a entrada para análise sintática.
\end{itemize}
\subsection*{Análise léxica}
\label{sec:orgc477053}

\begin{itemize}
\item Simplificações:
\begin{itemize}
\item Remoção de espaços em branco.
\item Remoção de comentários.
\end{itemize}

\item Resultado: lista de \textbf{\textbf{tokens}}.
\end{itemize}
\subsection*{Análise léxica}
\label{sec:orgf24635c}

\begin{itemize}
\item Token
\begin{itemize}
\item Componente indivisível da sintaxe de uma linguagem.
\end{itemize}
\item Exemplos:
\begin{itemize}
\item identificadores
\item palavras reservadas
\item separadores
\item literais
\end{itemize}
\end{itemize}
\subsection*{Análise léxica}
\label{sec:orga1ccf91}

\begin{itemize}
\item Como implementar a análise léxica?
\end{itemize}
\subsection*{Análise léxica ad-hoc}
\label{sec:orge42cf5c}

\begin{itemize}
\item Percorra a string:
\begin{itemize}
\item Se for um dígito, guarde-o para formar um número.
\item Se for um operador, gere o token.
\item Se for um parêntesis, gere o token.
\item Se for um espaço, tente gerar um número e descarte o espaço.
\end{itemize}
\end{itemize}
\subsection*{Análise léxica ad-hoc}
\label{sec:orgb625dec}

\begin{itemize}
\item Como representar tokens?
\begin{itemize}
\item Primeiro, definimos seus tipos: lexemas.
\end{itemize}
\end{itemize}

\begin{verbatim}
data Lexeme  
  = TNumber Value  
  | TPlus 
  | TMul
  | TLParen
  | TRParen 
\end{verbatim}
\subsection*{Análise léxica ad-hoc}
\label{sec:org3fed344}

\begin{itemize}
\item Token = lexema + posição
\end{itemize}

\begin{verbatim}
data Token 
  = Token {
      lexeme :: Lexeme
    , position :: (Int, Int)
    } 
\end{verbatim}
\subsection*{Análise léxica ad-hoc}
\label{sec:orged9d1fd}

\begin{itemize}
\item Configuração do analisador léxico
\begin{itemize}
\item Linha e coluna atual.
\item String de dígitos consecutivos encontrados.
\item Lista de tokens encontrados.
\end{itemize}
\end{itemize}

\begin{verbatim}
type Line = Int 
type Column = Int
type State = (Line, Column, String, [Token])
\end{verbatim}
\subsection*{Análise léxica ad-hoc}
\label{sec:orgb195486}

\begin{itemize}
\item Transição de estado sob um caractere
\end{itemize}

\begin{verbatim}
transition :: State -> Char -> Either String State
transition state@(l, col, t, ts) c 
  | c == '\n' = mkDigits state c 
  | isSpace c = mkDigits state c 
  | c == '+' = Right ( l, col + 1, ""
                     , mkToken state (Token TPlus (l,col)) ++ ts)
  | isDigit c = Right (l, col + 1, c : t, ts)
  | otherwise = unexpectedCharError l col c 
\end{verbatim}
