slides/aula01/aula01.org
** Análise léxica ad-hoc 

- Criando token de dígitos.

#+begin_src haskell 
mkDigits :: State -> Char -> Either String State  
mkDigits state@(l, col, s, ts) c 
  | null s = Right state 
  | all isDigit s 
      = let t = Token (TNumber (VInt (read $ reverse s))) (l,col)
            l' = if c == '\n' then l + 1 else l 
            col' = if c /= '\n' && isSpace c then col + 1 else col  
        in Right (l', col', "", t : ts)
  | otherwise = unexpectedCharError l col c
#+end_src

** Análise léxica ad-hoc

- Criando tokens 

#+begin_src haskell 
mkToken :: State -> Token -> [Token]
mkToken (l,c, s@(_ : _), _) t 
  | all isDigit s = [t, Token (TNumber (VInt (read $ reverse s))) (l,c)]
  | otherwise = [t]
mkToken _ t = [t] 
#+end_src

** Analise léxica ad-hoc

- Analisador léxico 
  - Caminhamento na entrada feito pela função foldl

#+begin_src haskell 
lexer :: String -> Either String [Token]
lexer = either Left (Right . extract) . foldl step start 
  where 
    start = Right (1,1,"",[])
    step ac@(Left _) _ = ac 
    step (Right state) c = transition state c  

    extract (l, col, s, ts) 
      | null s = reverse ts 
      | otherwise 
        = let t = Token (TNumber (VInt (read $ reverse s))) (l, col)
          in reverse (t : ts)
#+end_src 

* Análise sintática 

** Análise sintática

- Vamos considerar uma técnica de análise sintática chamada de análise descendente recursiva.
- Permite a construção manual de analisadores sintáticos.

** Análise sintática 

- Analisador descendente recursivo 
  - Uma função para cada não terminal da gramática

** Análise sintática

  - Lados direitos de regra como corpo da função 
    - Caso um elemento de regra seja um token, consumimos este token 
    - Caso seja um não terminal, chamamos a função correspondente.

** Análise sintática 

- Analisadores descentes recursivos não podem ser implementados para gramáticas recursivas à esquerda.
  - Gramáticas recursivas à esquerda geram parsers que entram em loop infinito!

** Análise sintática 

- Gramática para expressões
  - Regras recursivas à esquerda.

  \begin{array}{lcl}
    E & \to & n \,|\, E + E\,|\, E * E\,|\,(E)
  \end{array}

** Análise sintática 

- Gramática para expressões 
  - Sem regras recursivas à esquerda. 

  \begin{array}{lcl}
    E & \to & T + E\,|\,T\\
    T & \to & F * T\,|\,F\\
    F & \to & n \,|\, (E)\\
  \end{array}

** Análise sintática

- De posse de uma gramática adequada, podemos partir para uma implementação.

- Em linguagens funcionais, analisadores descendentes recursivos são implementados como combinadores.

** Análise sintática 

- Um parser é uma função:
  - Entrada uma lista de tokens (tipo s)

** Análise sintática
- Resultado: uma lista de pares de resultados e o restante de tokens. 
  - Lista vazia: erro
  - Lista unitária: resultado único
  - Lista com mais de um resultado: possibilidade de backtracking.

