slides/aula01/aula01.html
<section id="slide-org78e93df">
<h3 id="org78e93df">Análise léxica ad-hoc</h3>
<ul>
<li>Criando token de dígitos.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">mkDigits</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">State</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Char</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Either</span> <span style="color: #ECBE7B;">String</span> <span style="color: #ECBE7B;">State</span>  
<span style="color: #c678dd;">mkDigits</span> state<span style="color: #dcaeea;">@</span>(l, col, s, ts) c 
  <span style="color: #dcaeea;">|</span> null s <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Right</span> state 
  <span style="color: #dcaeea;">|</span> all isDigit s 
      <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">let</span> t <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Token</span> (<span style="color: #ECBE7B;">TNumber</span> (<span style="color: #ECBE7B;">VInt</span> (read <span style="color: #dcaeea;">$</span> reverse s))) (l,col)
            l' <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> c <span style="color: #dcaeea;">==</span> <span style="color: #98be65;">'\n'</span> <span style="color: #51afef;">then</span> l <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #51afef;">else</span> l 
            col' <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> c <span style="color: #dcaeea;">/=</span> <span style="color: #98be65;">'\n'</span> <span style="color: #dcaeea;">&amp;&amp;</span> isSpace c <span style="color: #51afef;">then</span> col <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #51afef;">else</span> col  
        <span style="color: #51afef;">in</span> <span style="color: #ECBE7B;">Right</span> (l', col', <span style="color: #98be65;">""</span>, t <span style="color: #ECBE7B;">:</span> ts)
  <span style="color: #dcaeea;">|</span> otherwise <span style="color: #dcaeea;">=</span> unexpectedCharError l col c
</pre>
</div>
</section>
<section id="slide-org2bce727">
<h3 id="org2bce727">Análise léxica ad-hoc</h3>
<ul>
<li>Criando tokens</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">mkToken</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">State</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Token</span> <span style="color: #dcaeea;">-&gt;</span> [<span style="color: #ECBE7B;">Token</span>]
<span style="color: #c678dd;">mkToken</span> (l,c, s<span style="color: #dcaeea;">@</span>(<span style="color: #51afef;">_</span> <span style="color: #ECBE7B;">:</span> <span style="color: #51afef;">_</span>), <span style="color: #51afef;">_</span>) t 
  <span style="color: #dcaeea;">|</span> all isDigit s <span style="color: #dcaeea;">=</span> [t, <span style="color: #ECBE7B;">Token</span> (<span style="color: #ECBE7B;">TNumber</span> (<span style="color: #ECBE7B;">VInt</span> (read <span style="color: #dcaeea;">$</span> reverse s))) (l,c)]
  <span style="color: #dcaeea;">|</span> otherwise <span style="color: #dcaeea;">=</span> [t]
<span style="color: #c678dd;">mkToken</span> <span style="color: #51afef;">_</span> t <span style="color: #dcaeea;">=</span> [t] 
</pre>
</div>
</section>
<section id="slide-orgf8f1d82">
<h3 id="orgf8f1d82">Analise léxica ad-hoc</h3>
<ul>
<li>Analisador léxico 
<ul>
<li>Caminhamento na entrada feito pela função foldl</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">lexer</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Either</span> <span style="color: #ECBE7B;">String</span> [<span style="color: #ECBE7B;">Token</span>]
<span style="color: #c678dd;">lexer</span> <span style="color: #dcaeea;">=</span> either <span style="color: #ECBE7B;">Left</span> (<span style="color: #ECBE7B;">Right</span> <span style="color: #dcaeea;">.</span> extract) <span style="color: #dcaeea;">.</span> foldl step start 
  <span style="color: #51afef;">where</span> 
    start <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Right</span> (<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #98be65;">""</span>,<span style="color: #ECBE7B;">[]</span>)
    step ac<span style="color: #dcaeea;">@</span>(<span style="color: #ECBE7B;">Left</span> <span style="color: #51afef;">_</span>) <span style="color: #51afef;">_</span> <span style="color: #dcaeea;">=</span> ac 
    step (<span style="color: #ECBE7B;">Right</span> state) c <span style="color: #dcaeea;">=</span> transition state c  

    extract (l, col, s, ts) 
      <span style="color: #dcaeea;">|</span> null s <span style="color: #dcaeea;">=</span> reverse ts 
      <span style="color: #dcaeea;">|</span> otherwise 
        <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">let</span> t <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Token</span> (<span style="color: #ECBE7B;">TNumber</span> (<span style="color: #ECBE7B;">VInt</span> (read <span style="color: #dcaeea;">$</span> reverse s))) (l, col)
          <span style="color: #51afef;">in</span> reverse (t <span style="color: #ECBE7B;">:</span> ts)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org979d26b">
<h2 id="org979d26b">Análise sintática</h2>
<div class="outline-text-2" id="text-org979d26b">
</div>
</section>
<section id="slide-org1ea2520">
<h3 id="org1ea2520">Análise sintática</h3>
<ul>
<li>Vamos considerar uma técnica de análise sintática chamada de análise descendente recursiva.</li>
<li>Permite a construção manual de analisadores sintáticos.</li>

</ul>
</section>
<section id="slide-org3f546b6">
<h3 id="org3f546b6">Análise sintática</h3>
<ul>
<li>Analisador descendente recursivo 
<ul>
<li>Uma função para cada não terminal da gramática</li>

</ul></li>

</ul>
</section>
<section id="slide-org2b53e8f">
<h3 id="org2b53e8f">Análise sintática</h3>
<ul>
<li>Lados direitos de regra como corpo da função 
<ul>
<li>Caso um elemento de regra seja um token, consumimos este token</li>
<li>Caso seja um não terminal, chamamos a função correspondente.</li>

</ul></li>

</ul>
</section>
<section id="slide-org8a18cd6">
<h3 id="org8a18cd6">Análise sintática</h3>
<ul>
<li>Analisadores descentes recursivos não podem ser implementados para gramáticas recursivas à esquerda.
<ul>
<li>Gramáticas recursivas à esquerda geram parsers que entram em loop infinito!</li>

</ul></li>

</ul>
</section>
<section id="slide-org50c4d7d">
<h3 id="org50c4d7d">Análise sintática</h3>
<ul>
<li><p>
Gramática para expressões
</p>
<ul>
<li>Regras recursivas à esquerda.</li>

</ul>

<div>
\begin{array}{lcl}
  E & \to & n \,|\, E + E\,|\, E * E\,|\,(E)
\end{array}

</div></li>

</ul>
</section>
<section id="slide-org9314280">
<h3 id="org9314280">Análise sintática</h3>
<ul>
<li><p>
Gramática para expressões 
</p>
<ul>
<li>Sem regras recursivas à esquerda.</li>

</ul>

<div>
\begin{array}{lcl}
  E & \to & T + E\,|\,T\\
  T & \to & F * T\,|\,F\\
  F & \to & n \,|\, (E)\\
\end{array}

</div></li>

</ul>
</section>
<section id="slide-org2579b81">
<h3 id="org2579b81">Análise sintática</h3>
<ul>
<li>De posse de uma gramática adequada, podemos partir para uma implementação.</li>

<li>Em linguagens funcionais, analisadores descendentes recursivos são implementados como combinadores.</li>

</ul>
</section>
<section id="slide-org9a3f85f">
<h3 id="org9a3f85f">Análise sintática</h3>
<ul>
<li>Um parser é uma função:
<ul>
<li>Entrada uma lista de tokens (tipo s)</li>

</ul></li>

</ul>
</section>
<section id="slide-org2090597">
<h3 id="org2090597">Análise sintática</h3>
<ul>
<li>Resultado: uma lista de pares de resultados e o restante de tokens. 
<ul>
<li>Lista vazia: erro</li>
<li>Lista unitária: resultado único</li>
<li>Lista com mais de um resultado: possibilidade de backtracking.</li>

</ul></li>

</ul>
</section>
