slides/aula01/aula01.tex
\subsection*{Análise léxica ad-hoc}
\label{sec:org18c2d63}

\begin{itemize}
\item Criando token de dígitos.
\end{itemize}

\begin{verbatim}
mkDigits :: State -> Char -> Either String State  
mkDigits state@(l, col, s, ts) c 
  | null s = Right state 
  | all isDigit s 
      = let t = Token (TNumber (VInt (read $ reverse s))) (l,col)
            l' = if c == '\n' then l + 1 else l 
            col' = if c /= '\n' && isSpace c then col + 1 else col  
        in Right (l', col', "", t : ts)
  | otherwise = unexpectedCharError l col c
\end{verbatim}
\subsection*{Análise léxica ad-hoc}
\label{sec:org5dca865}

\begin{itemize}
\item Criando tokens
\end{itemize}

\begin{verbatim}
mkToken :: State -> Token -> [Token]
mkToken (l,c, s@(_ : _), _) t 
  | all isDigit s = [t, Token (TNumber (VInt (read $ reverse s))) (l,c)]
  | otherwise = [t]
mkToken _ t = [t] 
\end{verbatim}
\subsection*{Analise léxica ad-hoc}
\label{sec:org4822d3d}

\begin{itemize}
\item Analisador léxico 
\begin{itemize}
\item Caminhamento na entrada feito pela função foldl
\end{itemize}
\end{itemize}

\begin{verbatim}
lexer :: String -> Either String [Token]
lexer = either Left (Right . extract) . foldl step start 
  where 
    start = Right (1,1,"",[])
    step ac@(Left _) _ = ac 
    step (Right state) c = transition state c  

    extract (l, col, s, ts) 
      | null s = reverse ts 
      | otherwise 
        = let t = Token (TNumber (VInt (read $ reverse s))) (l, col)
          in reverse (t : ts)
\end{verbatim}
\section*{Análise sintática}
\label{sec:org2416232}

\subsection*{Análise sintática}
\label{sec:org824b457}

\begin{itemize}
\item Vamos considerar uma técnica de análise sintática chamada de análise descendente recursiva.
\item Permite a construção manual de analisadores sintáticos.
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org2de1ce6}

\begin{itemize}
\item Analisador descendente recursivo 
\begin{itemize}
\item Uma função para cada não terminal da gramática
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org3a3a118}

\begin{itemize}
\item Lados direitos de regra como corpo da função 
\begin{itemize}
\item Caso um elemento de regra seja um token, consumimos este token
\item Caso seja um não terminal, chamamos a função correspondente.
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org6582ee3}

\begin{itemize}
\item Analisadores descentes recursivos não podem ser implementados para gramáticas recursivas à esquerda.
\begin{itemize}
\item Gramáticas recursivas à esquerda geram parsers que entram em loop infinito!
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org2296ca1}

\begin{itemize}
\item Gramática para expressões
\begin{itemize}
\item Regras recursivas à esquerda.
\end{itemize}

\begin{array}{lcl}
  E & \to & n \,|\, E + E\,|\, E * E\,|\,(E)
\end{array}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org46343a7}

\begin{itemize}
\item Gramática para expressões 
\begin{itemize}
\item Sem regras recursivas à esquerda.
\end{itemize}

\begin{array}{lcl}
  E & \to & T + E\,|\,T\\
  T & \to & F * T\,|\,F\\
  F & \to & n \,|\, (E)\\
\end{array}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org3348bbd}

\begin{itemize}
\item De posse de uma gramática adequada, podemos partir para uma implementação.

\item Em linguagens funcionais, analisadores descendentes recursivos são implementados como combinadores.
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org904a39e}

\begin{itemize}
\item Um parser é uma função:
\begin{itemize}
\item Entrada uma lista de tokens (tipo s)
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org005f3f3}
\begin{itemize}
\item Resultado: uma lista de pares de resultados e o restante de tokens. 
\begin{itemize}
\item Lista vazia: erro
\item Lista unitária: resultado único
\item Lista com mais de um resultado: possibilidade de backtracking.
\end{itemize}
\end{itemize}
