slides/aula01/aula01.org
** Análise sintática 

- Representando em Haskell 

#+begin_src haskell
newtype Parser s a 
  = Parser { runParser :: [s] -> [(a, [s])] }
#+end_src

** Análise sintática 

- Processando um token. 

#+begin_src haskell 
sat :: (s -> Bool) -> Parser s s
sat p = Parser (\ ts -> case ts of 
                          [] -> [] 
                          (t' : ts') -> 
                            if p t' then [(t', ts')] 
                                    else [])
#+end_src 

** Análise sintática 

- Processando uma sequência de tokens.

#+begin_src haskell 
token :: Eq s => [s] -> Parser s [s]
token s = Parser (\ ts -> if (take (length s) ts) == s 
                          then [(s, drop (length s) ts)]
                          else [])
#+end_src

** Análise sintática 

- Construção de resultados (instância de Functor)

#+begin_src haskell
instance Functor (Parser s) where 
  fmap f (Parser p) = Parser g 
    where g ts = [(f x, ts') | (x, ts') <- p ts]
#+end_src

** Análise sintática 

- Processando um dígito 

#+begin_src haskell 
digit :: Parser Char Char 
digit = sat isDigit
#+end_src

** Análise sintática 

- Concatenação de parser (instance de Applicative)

#+begin_src haskell 
instance Applicative (Parser s) where 
  pure x = Parser (\ ts -> [(x,ts)])
  (Parser pf) <*> (Parser px)
    = Parser (\ ts -> [(f x, ts') | (f, ts1) <- pf ts
                                  , (x, ts') <- px ts1])
#+end_src

** Análise sintática 

- Alternativas de parsers (instance de Alternative)

#+begin_src haskell 
instance Alternative (Parser s) where 
  empty = Parser (\ _ -> [])
  (Parser p1) <|> (Parser p2) = Parser f 
    where f ts = p1 ts ++ p2 ts
#+end_src

** Análise sintática 

- Repetindo um parser 

#+begin_src haskell 
many :: Parser s a -> Parser s [a]
many p = (:) <$> p <*> many p <|> pure []
#+end_src 

** Análise sintática 

- Parser para números naturais 

#+begin_src haskell 
natural :: Parser Char Int 
natural 
  = foldl f 0 <$> many digit  
    where 
      f a b = a * 10 + b 
#+end_src

** Análise sintática 

- Executando um parser opcionalmente.

#+begin_src haskell 
option :: Parser s a -> a -> Parser s a 
option p v = p <|> pure v 
#+end_src 

** Análise sintática 

- Parser para números inteiros 

#+begin_src haskell
integer :: Parser Char Int 
integer = option (const negate <$> token "-") id <*> natural
#+end_src

