slides/aula01/aula01.html
<section id="slide-org896003d">
<h3 id="org896003d">Análise sintática</h3>
<ul>
<li>Representando em Haskell</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">newtype</span> <span style="color: #ECBE7B;">Parser</span> s a 
  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> { runParser <span style="color: #dcaeea;">::</span> [s] <span style="color: #dcaeea;">-&gt;</span> [(a, [s])] }
</pre>
</div>
</section>
<section id="slide-org4557a3c">
<h3 id="org4557a3c">Análise sintática</h3>
<ul>
<li>Processando um token.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">sat</span> <span style="color: #dcaeea;">::</span> (s <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Bool</span>) <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s s
<span style="color: #c678dd;">sat</span> p <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #dcaeea;">\</span> ts <span style="color: #dcaeea;">-&gt;</span> <span style="color: #51afef;">case</span> ts <span style="color: #51afef;">of</span> 
                          <span style="color: #ECBE7B;">[]</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">[]</span> 
                          (t' <span style="color: #ECBE7B;">:</span> ts') <span style="color: #dcaeea;">-&gt;</span> 
                            <span style="color: #51afef;">if</span> p t' <span style="color: #51afef;">then</span> [(t', ts')] 
                                    <span style="color: #51afef;">else</span> <span style="color: #ECBE7B;">[]</span>)
</pre>
</div>
</section>
<section id="slide-orgdc17691">
<h3 id="orgdc17691">Análise sintática</h3>
<ul>
<li>Processando uma sequência de tokens.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">token</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Eq</span> s <span style="color: #dcaeea;">=&gt;</span> [s] <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s [s]
<span style="color: #c678dd;">token</span> s <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #dcaeea;">\</span> ts <span style="color: #dcaeea;">-&gt;</span> <span style="color: #51afef;">if</span> (take (length s) ts) <span style="color: #dcaeea;">==</span> s 
                          <span style="color: #51afef;">then</span> [(s, drop (length s) ts)]
                          <span style="color: #51afef;">else</span> <span style="color: #ECBE7B;">[]</span>)
</pre>
</div>
</section>
<section id="slide-org47d4e95">
<h3 id="org47d4e95">Análise sintática</h3>
<ul>
<li>Construção de resultados (instância de Functor)</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Functor</span> (<span style="color: #ECBE7B;">Parser</span> s) <span style="color: #51afef;">where</span> 
  fmap f (<span style="color: #ECBE7B;">Parser</span> p) <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> g 
    <span style="color: #51afef;">where</span> g ts <span style="color: #dcaeea;">=</span> [(f x, ts') <span style="color: #dcaeea;">|</span> (x, ts') <span style="color: #dcaeea;">&lt;-</span> p ts]
</pre>
</div>
</section>
<section id="slide-orgee15139">
<h3 id="orgee15139">Análise sintática</h3>
<ul>
<li>Processando um dígito</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">digit</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span> <span style="color: #ECBE7B;">Char</span> 
<span style="color: #c678dd;">digit</span> <span style="color: #dcaeea;">=</span> sat isDigit
</pre>
</div>
</section>
<section id="slide-org411388b">
<h3 id="org411388b">Análise sintática</h3>
<ul>
<li>Concatenação de parser (instance de Applicative)</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Applicative</span> (<span style="color: #ECBE7B;">Parser</span> s) <span style="color: #51afef;">where</span> 
  pure x <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #dcaeea;">\</span> ts <span style="color: #dcaeea;">-&gt;</span> [(x,ts)])
  (<span style="color: #ECBE7B;">Parser</span> pf) <span style="color: #dcaeea;">&lt;*&gt;</span> (<span style="color: #ECBE7B;">Parser</span> px)
    <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #dcaeea;">\</span> ts <span style="color: #dcaeea;">-&gt;</span> [(f x, ts') <span style="color: #dcaeea;">|</span> (f, ts1) <span style="color: #dcaeea;">&lt;-</span> pf ts
                                  , (x, ts') <span style="color: #dcaeea;">&lt;-</span> px ts1])
</pre>
</div>
</section>
<section id="slide-org29dac21">
<h3 id="org29dac21">Análise sintática</h3>
<ul>
<li>Alternativas de parsers (instance de Alternative)</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Alternative</span> (<span style="color: #ECBE7B;">Parser</span> s) <span style="color: #51afef;">where</span> 
  empty <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #dcaeea;">\</span> <span style="color: #51afef;">_</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">[]</span>)
  (<span style="color: #ECBE7B;">Parser</span> p1) <span style="color: #dcaeea;">&lt;|&gt;</span> (<span style="color: #ECBE7B;">Parser</span> p2) <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Parser</span> f 
    <span style="color: #51afef;">where</span> f ts <span style="color: #dcaeea;">=</span> p1 ts <span style="color: #dcaeea;">++</span> p2 ts
</pre>
</div>
</section>
<section id="slide-org8372ac2">
<h3 id="org8372ac2">Análise sintática</h3>
<ul>
<li>Repetindo um parser</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">many</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> s a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s [a]
<span style="color: #c678dd;">many</span> p <span style="color: #dcaeea;">=</span> (<span style="color: #ECBE7B;">:</span>) <span style="color: #dcaeea;">&lt;$&gt;</span> p <span style="color: #dcaeea;">&lt;*&gt;</span> many p <span style="color: #dcaeea;">&lt;|&gt;</span> pure <span style="color: #ECBE7B;">[]</span>
</pre>
</div>
</section>
<section id="slide-orge5b8121">
<h3 id="orge5b8121">Análise sintática</h3>
<ul>
<li>Parser para números naturais</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">natural</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span> <span style="color: #ECBE7B;">Int</span> 
<span style="color: #c678dd;">natural</span> 
  <span style="color: #dcaeea;">=</span> foldl f <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #dcaeea;">&lt;$&gt;</span> many digit  
    <span style="color: #51afef;">where</span> 
      f a b <span style="color: #dcaeea;">=</span> a <span style="color: #dcaeea;">*</span> <span style="color: #da8548; font-weight: bold;">10</span> <span style="color: #dcaeea;">+</span> b 
</pre>
</div>
</section>
<section id="slide-org0e5badc">
<h3 id="org0e5badc">Análise sintática</h3>
<ul>
<li>Executando um parser opcionalmente.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">option</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> s a <span style="color: #dcaeea;">-&gt;</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s a 
<span style="color: #c678dd;">option</span> p v <span style="color: #dcaeea;">=</span> p <span style="color: #dcaeea;">&lt;|&gt;</span> pure v 
</pre>
</div>
</section>
<section id="slide-orgad67eae">
<h3 id="orgad67eae">Análise sintática</h3>
<ul>
<li>Parser para números inteiros</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">integer</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span> <span style="color: #ECBE7B;">Int</span> 
<span style="color: #c678dd;">integer</span> <span style="color: #dcaeea;">=</span> option (const negate <span style="color: #dcaeea;">&lt;$&gt;</span> token <span style="color: #98be65;">"-"</span>) id <span style="color: #dcaeea;">&lt;*&gt;</span> natural
</pre>
</div>
</section>
