slides/aula01/aula01.tex
\subsection*{Análise sintática}
\label{sec:orgbad0d19}

\begin{itemize}
\item Representando em Haskell
\end{itemize}

\begin{verbatim}
newtype Parser s a 
  = Parser { runParser :: [s] -> [(a, [s])] }
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org77bbf64}

\begin{itemize}
\item Processando um token.
\end{itemize}

\begin{verbatim}
sat :: (s -> Bool) -> Parser s s
sat p = Parser (\ ts -> case ts of 
                          [] -> [] 
                          (t' : ts') -> 
                            if p t' then [(t', ts')] 
                                    else [])
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org752aaff}

\begin{itemize}
\item Processando uma sequência de tokens.
\end{itemize}

\begin{verbatim}
token :: Eq s => [s] -> Parser s [s]
token s = Parser (\ ts -> if (take (length s) ts) == s 
                          then [(s, drop (length s) ts)]
                          else [])
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org32af6aa}

\begin{itemize}
\item Construção de resultados (instância de Functor)
\end{itemize}

\begin{verbatim}
instance Functor (Parser s) where 
  fmap f (Parser p) = Parser g 
    where g ts = [(f x, ts') | (x, ts') <- p ts]
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:orgdb57a0e}

\begin{itemize}
\item Processando um dígito
\end{itemize}

\begin{verbatim}
digit :: Parser Char Char 
digit = sat isDigit
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org470cdb3}

\begin{itemize}
\item Concatenação de parser (instance de Applicative)
\end{itemize}

\begin{verbatim}
instance Applicative (Parser s) where 
  pure x = Parser (\ ts -> [(x,ts)])
  (Parser pf) <*> (Parser px)
    = Parser (\ ts -> [(f x, ts') | (f, ts1) <- pf ts
                                  , (x, ts') <- px ts1])
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org30a67f3}

\begin{itemize}
\item Alternativas de parsers (instance de Alternative)
\end{itemize}

\begin{verbatim}
instance Alternative (Parser s) where 
  empty = Parser (\ _ -> [])
  (Parser p1) <|> (Parser p2) = Parser f 
    where f ts = p1 ts ++ p2 ts
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:orgea93aa4}

\begin{itemize}
\item Repetindo um parser
\end{itemize}

\begin{verbatim}
many :: Parser s a -> Parser s [a]
many p = (:) <$> p <*> many p <|> pure []
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org6eda6cf}

\begin{itemize}
\item Parser para números naturais
\end{itemize}

\begin{verbatim}
natural :: Parser Char Int 
natural 
  = foldl f 0 <$> many digit  
    where 
      f a b = a * 10 + b 
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org3882776}

\begin{itemize}
\item Executando um parser opcionalmente.
\end{itemize}

\begin{verbatim}
option :: Parser s a -> a -> Parser s a 
option p v = p <|> pure v 
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org424d82b}

\begin{itemize}
\item Parser para números inteiros
\end{itemize}

\begin{verbatim}
integer :: Parser Char Int 
integer = option (const negate <$> token "-") id <*> natural
\end{verbatim}
