slides/aula01/aula01.org
** Análise sintática 

- Lidando com separadores. 
  - Separadores sem semântica 

#+begin_src haskell 
endBy :: Parser s a -> Parser s b -> Parser s [a]
p `endBy` e 
  = many (f <$> p <*> e) 
    where 
      f x _ = x 
#+end_src

** Análise sintática 

- Lidando com separadores 
  - Separadores com semântica (operadores)

#+begin_src haskell 
chainl :: Parser s (a -> a -> a) -> Parser s a -> Parser s a
chainl op p 
  = applyAll <$> p <*> many (flip <$> op <*> p)
    where 
      applyAll x [] = x
      applyAll x (f : fs) = applyAll (f x) fs
#+end_src

** Análise sintática 

- De posse de todas essas funções, podemos construir o analisador sintático para a gramática.

  \begin{array}{lcl}
    E & \to & T + E\,|\,T\\
    T & \to & F * T\,|\,F\\
    F & \to & n \,|\, (E)\\
  \end{array}

** Análise sintática

- Antes de construir um parser, precisamos definir o resultado 
  - Árvore de sintaxe abstrata.
- Valores 

#+begin_src haskell 
data Value 
  = VInt Int
#+end_src 

** Análise sintática 

- Programas completos: expressões envolvendo adição e multiplicação.

#+begin_src haskell 
data L0 
  = LVal Value  
  | LAdd L0 L0 
  | LMul L0 L0 
#+end_src

** Análise sintática 

- Parser de valores 

#+begin_src haskell 
valueParser :: Parser Value
valueParser = f <$> sat (\ t -> case lexeme t of 
                                  TNumber _ -> True 
                                  _ -> False)
      where 
        f (Token (TNumber n) _) = n 
#+end_src 

** Análise sintática 

- Parsing de parêntesis. 

#+begin_src haskell 
parens :: Parser a -> Parser a 
parens p 
  = f <$> lparen <*> p <*> rparen 
    where 
      f _ x _ = x 

lparen :: Parser Token 
lparen = sat (\ t -> lexeme t == TLParen)

rparen :: Parser Token 
rparen = sat (\ t -> lexeme t == TRParen)
#+end_src 

** Análise sintática 

- Parser de fatores

#+begin_src haskell 
factorParser :: Parser L0
factorParser 
  = (LVal <$> valueParser) <|> parens expParser 
#+end_src 

** Análise sintática 

- Parser de termos 

#+begin_src haskell 
termParser :: Parser L0 
termParser 
  = chainl pmult factorParser
    where  
      pmult = (const LMul) <$> sat (\ t -> lexeme t == TMul)
#+end_src 

** Análise sintática 

- Parser de expressões 

#+begin_src haskell 
expParser :: Parser L0 
expParser 
  = chainl padd termParser
    where 
      padd = (const LAdd) <$> sat (\ t -> lexeme t == TPlus)
#+end_src 

