slides/aula01/aula01.html
<section id="slide-org6d1c9d0">
<h3 id="org6d1c9d0">Análise sintática</h3>
<ul>
<li>Lidando com separadores. 
<ul>
<li>Separadores sem semântica</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">endBy</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> s a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s [a]
p <span style="color: #dcaeea;">`</span><span style="color: #c678dd;">endBy</span><span style="color: #dcaeea;">`</span> e 
  <span style="color: #dcaeea;">=</span> many (f <span style="color: #dcaeea;">&lt;$&gt;</span> p <span style="color: #dcaeea;">&lt;*&gt;</span> e) 
    <span style="color: #51afef;">where</span> 
      f x <span style="color: #51afef;">_</span> <span style="color: #dcaeea;">=</span> x 
</pre>
</div>
</section>
<section id="slide-org750d5d6">
<h3 id="org750d5d6">Análise sintática</h3>
<ul>
<li>Lidando com separadores 
<ul>
<li>Separadores com semântica (operadores)</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">chainl</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> s (a <span style="color: #dcaeea;">-&gt;</span> a <span style="color: #dcaeea;">-&gt;</span> a) <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> s a
<span style="color: #c678dd;">chainl</span> op p 
  <span style="color: #dcaeea;">=</span> applyAll <span style="color: #dcaeea;">&lt;$&gt;</span> p <span style="color: #dcaeea;">&lt;*&gt;</span> many (flip <span style="color: #dcaeea;">&lt;$&gt;</span> op <span style="color: #dcaeea;">&lt;*&gt;</span> p)
    <span style="color: #51afef;">where</span> 
      applyAll x <span style="color: #ECBE7B;">[]</span> <span style="color: #dcaeea;">=</span> x
      applyAll x (f <span style="color: #ECBE7B;">:</span> fs) <span style="color: #dcaeea;">=</span> applyAll (f x) fs
</pre>
</div>
</section>
<section id="slide-org986a79b">
<h3 id="org986a79b">Análise sintática</h3>
<ul>
<li><p>
De posse de todas essas funções, podemos construir o analisador sintático para a gramática.
</p>

<div>
\begin{array}{lcl}
  E & \to & T + E\,|\,T\\
  T & \to & F * T\,|\,F\\
  F & \to & n \,|\, (E)\\
\end{array}

</div></li>

</ul>
</section>
<section id="slide-org1e55341">
<h3 id="org1e55341">Análise sintática</h3>
<ul>
<li>Antes de construir um parser, precisamos definir o resultado 
<ul>
<li>Árvore de sintaxe abstrata.</li>

</ul></li>
<li>Valores</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">Value</span> 
  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">VInt</span> <span style="color: #ECBE7B;">Int</span>
</pre>
</div>
</section>
<section id="slide-orge3bd18e">
<h3 id="orge3bd18e">Análise sintática</h3>
<ul>
<li>Programas completos: expressões envolvendo adição e multiplicação.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">L0</span> 
  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">LVal</span> <span style="color: #ECBE7B;">Value</span>  
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">LAdd</span> <span style="color: #ECBE7B;">L0</span> <span style="color: #ECBE7B;">L0</span> 
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">LMul</span> <span style="color: #ECBE7B;">L0</span> <span style="color: #ECBE7B;">L0</span> 
</pre>
</div>
</section>
<section id="slide-org05d7051">
<h3 id="org05d7051">Análise sintática</h3>
<ul>
<li>Parser de valores</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">valueParser</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Value</span>
<span style="color: #c678dd;">valueParser</span> <span style="color: #dcaeea;">=</span> f <span style="color: #dcaeea;">&lt;$&gt;</span> sat (<span style="color: #dcaeea;">\</span> t <span style="color: #dcaeea;">-&gt;</span> <span style="color: #51afef;">case</span> lexeme t <span style="color: #51afef;">of</span> 
                                  <span style="color: #ECBE7B;">TNumber</span> <span style="color: #51afef;">_</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">True</span> 
                                  <span style="color: #51afef;">_</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">False</span>)
      <span style="color: #51afef;">where</span> 
        f (<span style="color: #ECBE7B;">Token</span> (<span style="color: #ECBE7B;">TNumber</span> n) <span style="color: #51afef;">_</span>) <span style="color: #dcaeea;">=</span> n 
</pre>
</div>
</section>
<section id="slide-org035fa20">
<h3 id="org035fa20">Análise sintática</h3>
<ul>
<li>Parsing de parêntesis.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">parens</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a 
<span style="color: #c678dd;">parens</span> p 
  <span style="color: #dcaeea;">=</span> f <span style="color: #dcaeea;">&lt;$&gt;</span> lparen <span style="color: #dcaeea;">&lt;*&gt;</span> p <span style="color: #dcaeea;">&lt;*&gt;</span> rparen 
    <span style="color: #51afef;">where</span> 
      f <span style="color: #51afef;">_</span> x <span style="color: #51afef;">_</span> <span style="color: #dcaeea;">=</span> x 

<span style="color: #c678dd;">lparen</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Token</span> 
<span style="color: #c678dd;">lparen</span> <span style="color: #dcaeea;">=</span> sat (<span style="color: #dcaeea;">\</span> t <span style="color: #dcaeea;">-&gt;</span> lexeme t <span style="color: #dcaeea;">==</span> <span style="color: #ECBE7B;">TLParen</span>)

<span style="color: #c678dd;">rparen</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Token</span> 
<span style="color: #c678dd;">rparen</span> <span style="color: #dcaeea;">=</span> sat (<span style="color: #dcaeea;">\</span> t <span style="color: #dcaeea;">-&gt;</span> lexeme t <span style="color: #dcaeea;">==</span> <span style="color: #ECBE7B;">TRParen</span>)
</pre>
</div>
</section>
<section id="slide-org3d41367">
<h3 id="org3d41367">Análise sintática</h3>
<ul>
<li>Parser de fatores</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">factorParser</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">L0</span>
<span style="color: #c678dd;">factorParser</span> 
  <span style="color: #dcaeea;">=</span> (<span style="color: #ECBE7B;">LVal</span> <span style="color: #dcaeea;">&lt;$&gt;</span> valueParser) <span style="color: #dcaeea;">&lt;|&gt;</span> parens expParser 
</pre>
</div>
</section>
<section id="slide-orgd3ae5a4">
<h3 id="orgd3ae5a4">Análise sintática</h3>
<ul>
<li>Parser de termos</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">termParser</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">L0</span> 
<span style="color: #c678dd;">termParser</span> 
  <span style="color: #dcaeea;">=</span> chainl pmult factorParser
    <span style="color: #51afef;">where</span>  
      pmult <span style="color: #dcaeea;">=</span> (const <span style="color: #ECBE7B;">LMul</span>) <span style="color: #dcaeea;">&lt;$&gt;</span> sat (<span style="color: #dcaeea;">\</span> t <span style="color: #dcaeea;">-&gt;</span> lexeme t <span style="color: #dcaeea;">==</span> <span style="color: #ECBE7B;">TMul</span>)
</pre>
</div>
</section>
<section id="slide-org78ff3ae">
<h3 id="org78ff3ae">Análise sintática</h3>
<ul>
<li>Parser de expressões</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">expParser</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">L0</span> 
<span style="color: #c678dd;">expParser</span> 
  <span style="color: #dcaeea;">=</span> chainl padd termParser
    <span style="color: #51afef;">where</span> 
      padd <span style="color: #dcaeea;">=</span> (const <span style="color: #ECBE7B;">LAdd</span>) <span style="color: #dcaeea;">&lt;$&gt;</span> sat (<span style="color: #dcaeea;">\</span> t <span style="color: #dcaeea;">-&gt;</span> lexeme t <span style="color: #dcaeea;">==</span> <span style="color: #ECBE7B;">TPlus</span>)
</pre>
</div>
</section>
