slides/aula01/aula01.tex
\subsection*{Análise sintática}
\label{sec:org7514f54}

\begin{itemize}
\item Lidando com separadores. 
\begin{itemize}
\item Separadores sem semântica
\end{itemize}
\end{itemize}

\begin{verbatim}
endBy :: Parser s a -> Parser s b -> Parser s [a]
p `endBy` e 
  = many (f <$> p <*> e) 
    where 
      f x _ = x 
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org5d2e9aa}

\begin{itemize}
\item Lidando com separadores 
\begin{itemize}
\item Separadores com semântica (operadores)
\end{itemize}
\end{itemize}

\begin{verbatim}
chainl :: Parser s (a -> a -> a) -> Parser s a -> Parser s a
chainl op p 
  = applyAll <$> p <*> many (flip <$> op <*> p)
    where 
      applyAll x [] = x
      applyAll x (f : fs) = applyAll (f x) fs
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:orge6e3fd8}

\begin{itemize}
\item De posse de todas essas funções, podemos construir o analisador sintático para a gramática.

\begin{array}{lcl}
  E & \to & T + E\,|\,T\\
  T & \to & F * T\,|\,F\\
  F & \to & n \,|\, (E)\\
\end{array}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org04985e6}

\begin{itemize}
\item Antes de construir um parser, precisamos definir o resultado 
\begin{itemize}
\item Árvore de sintaxe abstrata.
\end{itemize}
\item Valores
\end{itemize}

\begin{verbatim}
data Value 
  = VInt Int
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org43c5d0a}

\begin{itemize}
\item Programas completos: expressões envolvendo adição e multiplicação.
\end{itemize}

\begin{verbatim}
data L0 
  = LVal Value  
  | LAdd L0 L0 
  | LMul L0 L0 
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org933aa05}

\begin{itemize}
\item Parser de valores
\end{itemize}

\begin{verbatim}
valueParser :: Parser Value
valueParser = f <$> sat (\ t -> case lexeme t of 
                                  TNumber _ -> True 
                                  _ -> False)
      where 
        f (Token (TNumber n) _) = n 
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org60659d3}

\begin{itemize}
\item Parsing de parêntesis.
\end{itemize}

\begin{verbatim}
parens :: Parser a -> Parser a 
parens p 
  = f <$> lparen <*> p <*> rparen 
    where 
      f _ x _ = x 

lparen :: Parser Token 
lparen = sat (\ t -> lexeme t == TLParen)

rparen :: Parser Token 
rparen = sat (\ t -> lexeme t == TRParen)
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org087b57c}

\begin{itemize}
\item Parser de fatores
\end{itemize}

\begin{verbatim}
factorParser :: Parser L0
factorParser 
  = (LVal <$> valueParser) <|> parens expParser 
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org5cf0743}

\begin{itemize}
\item Parser de termos
\end{itemize}

\begin{verbatim}
termParser :: Parser L0 
termParser 
  = chainl pmult factorParser
    where  
      pmult = (const LMul) <$> sat (\ t -> lexeme t == TMul)
\end{verbatim}
\subsection*{Análise sintática}
\label{sec:org4dc19c2}

\begin{itemize}
\item Parser de expressões
\end{itemize}

\begin{verbatim}
expParser :: Parser L0 
expParser 
  = chainl padd termParser
    where 
      padd = (const LAdd) <$> sat (\ t -> lexeme t == TPlus)
\end{verbatim}
