slides/aula01/aula01.org
** Análise sintática 

- Função top-level do analisador sintático 

#+begin_src haskell 
l0Parser :: [Token] -> Either String L0 
l0Parser tks 
  = case runParser expParser tks of 
      ((t, []) : _) -> Right t 
      _             -> Left "Parse error on program."
#+end_src   
* Intepretador 
  
**   Interpretador 

- De posse de um analisador sintático, podemos agora:
  - Executar o código (interpretador)
  - Gerar código (compilador)

** Interpretador 

- Intepretador:

#+begin_src haskell 
eval :: L0 -> Either String Value 
eval (LVal v) = Right v 
eval (LAdd l1 l2) 
  = do 
       v1 <- eval l1 
       v2 <- eval l2 
       v1 .+. v2 
eval (LMul l1 l2) 
  = do 
       v1 <- eval l1
       v2 <- eval l2 
       v1 .*. v2
#+end_src 

** Interpretador 

- Operações sobre valores. 

#+begin_src haskell 
(.+.) :: Value -> Value -> Either String Value 
(VInt n1) .+. (VInt n2) = Right (VInt (n1 + n2))
e1 .+. e2 = Left $ unwords ["Type error on:", pretty e1, "+", pretty e2] 
#+end_src

* Geração de código 

** Geração de código 

- Vamos agora considerar o problema de gerar código. 
  - Para uma máquina virtual
  - Executável, gerando código fonte C, e usar o gcc para produzir o executável.

** Geração de código

- Gerar o código C correspondente consiste em:
  - Produzir o código com uma função main.
  - Corpo da função possui uma variável que recebe o resultado da expressão.
  - Imprime o valor da variável usando printf.

** Geração de código 

- Exemplo:
  - Considere a expressão: (1 + 2) * 3

#+begin_src c
#include <stdio.h>
// code generated for expressions
int main () {
   int val = (1 + 2) * 3;
   printf("%d", val);
   putchar('\n');
   return 0;
}
#+end_src

** Geração de código 

- Como produzir esse código C?
  - Vamos criar funções para produzir a expressão. 
  - Usar um "template" do corpo do código C. 

** Geração de código 

- Como produzir o texto da expressão a partir da AST?
  - Essa é a operação inversa da análise sintática 
  - Normalmente conhecida como pretty-print 

** Geração de código 

- Para isso, vamos utilizar uma biblioteca Haskell para facilitar essa tarefa.

- Para construir o pretty-print, vamos seguir a estrutura da gramática. 
  - Vantagem: evita parêntesis desnecessários.

** Geração de código

- Gramática

  \begin{array}{lcl}
    E & \to & T + E\,|\,T\\
    T & \to & F * T\,|\,F\\
    F & \to & n \,|\, (E)\\
  \end{array}

** Geração de código 

- Primeiro nível do pretty-print

#+begin_src haskell
pprAdd :: L0 -> Doc
pprAdd (LAdd e1 e2)
  = hsep [pprAdd e1, text "+", pprAdd e2]
pprAdd other = pprMul other 
#+end_src

** Geração de código 

- Segundo nível do pretty-print

#+begin_src haskell 
pprMul :: L0 -> Doc 
pprMul (LMul e1 e2) 
  = hsep [pprMul e1, text "*", pprMul e2]
pprMul other = pprFact other 
#+end_src

