slides/aula01/aula01.html
<section id="slide-org1edc844">
<h3 id="org1edc844">Análise sintática</h3>
<ul>
<li>Função top-level do analisador sintático</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">l0Parser</span> <span style="color: #dcaeea;">::</span> [<span style="color: #ECBE7B;">Token</span>] <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Either</span> <span style="color: #ECBE7B;">String</span> <span style="color: #ECBE7B;">L0</span> 
<span style="color: #c678dd;">l0Parser</span> tks 
  <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">case</span> runParser expParser tks <span style="color: #51afef;">of</span> 
      ((t, <span style="color: #ECBE7B;">[]</span>) <span style="color: #ECBE7B;">:</span> <span style="color: #51afef;">_</span>) <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Right</span> t 
      <span style="color: #51afef;">_</span>             <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Left</span> <span style="color: #98be65;">"Parse error on program."</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org83da681">
<h2 id="org83da681">Intepretador</h2>
<div class="outline-text-2" id="text-org83da681">
</div>
</section>
<section id="slide-orge962ec6">
<h3 id="orge962ec6">Interpretador</h3>
<ul>
<li>De posse de um analisador sintático, podemos agora:
<ul>
<li>Executar o código (interpretador)</li>
<li>Gerar código (compilador)</li>

</ul></li>

</ul>
</section>
<section id="slide-org01b9df5">
<h3 id="org01b9df5">Interpretador</h3>
<ul>
<li>Intepretador:</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">eval</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">L0</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Either</span> <span style="color: #ECBE7B;">String</span> <span style="color: #ECBE7B;">Value</span> 
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">LVal</span> v) <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Right</span> v 
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">LAdd</span> l1 l2) 
  <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span> 
       v1 <span style="color: #dcaeea;">&lt;-</span> eval l1 
       v2 <span style="color: #dcaeea;">&lt;-</span> eval l2 
       v1 <span style="color: #dcaeea;">.+.</span> v2 
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">LMul</span> l1 l2) 
  <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span> 
       v1 <span style="color: #dcaeea;">&lt;-</span> eval l1
       v2 <span style="color: #dcaeea;">&lt;-</span> eval l2 
       v1 <span style="color: #dcaeea;">.*.</span> v2
</pre>
</div>
</section>
<section id="slide-org6d61854">
<h3 id="org6d61854">Interpretador</h3>
<ul>
<li>Operações sobre valores.</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #c678dd;">.+.</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Value</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Value</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Either</span> <span style="color: #ECBE7B;">String</span> <span style="color: #ECBE7B;">Value</span> 
(<span style="color: #ECBE7B;">VInt</span> n1) <span style="color: #dcaeea;">.+.</span> (<span style="color: #ECBE7B;">VInt</span> n2) <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Right</span> (<span style="color: #ECBE7B;">VInt</span> (n1 <span style="color: #dcaeea;">+</span> n2))
e1 <span style="color: #c678dd;">.+.</span> e2 <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Left</span> <span style="color: #dcaeea;">$</span> unwords [<span style="color: #98be65;">"Type error on:"</span>, pretty e1, <span style="color: #98be65;">"+"</span>, pretty e2] 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org058b9cf">
<h2 id="org058b9cf">Geração de código</h2>
<div class="outline-text-2" id="text-org058b9cf">
</div>
</section>
<section id="slide-org03df3cf">
<h3 id="org03df3cf">Geração de código</h3>
<ul>
<li>Vamos agora considerar o problema de gerar código. 
<ul>
<li>Para uma máquina virtual</li>
<li>Executável, gerando código fonte C, e usar o gcc para produzir o executável.</li>

</ul></li>

</ul>
</section>
<section id="slide-org543be74">
<h3 id="org543be74">Geração de código</h3>
<ul>
<li>Gerar o código C correspondente consiste em:
<ul>
<li>Produzir o código com uma função main.</li>
<li>Corpo da função possui uma variável que recebe o resultado da expressão.</li>
<li>Imprime o valor da variável usando printf.</li>

</ul></li>

</ul>
</section>
<section id="slide-org92512a5">
<h3 id="org92512a5">Geração de código</h3>
<ul>
<li>Exemplo:
<ul>
<li>Considere a expressão: (1 + 2) * 3</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;stdio.h&gt;</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">code generated for expressions</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
   <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">val</span> = (<span style="color: #da8548; font-weight: bold;">1</span> + <span style="color: #da8548; font-weight: bold;">2</span>) * <span style="color: #da8548; font-weight: bold;">3</span>;
   printf(<span style="color: #98be65;">"%d"</span>, val);
   putchar(<span style="color: #98be65;">'\n'</span>);
   <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>;
}
</pre>
</div>
</section>
<section id="slide-orgea683b7">
<h3 id="orgea683b7">Geração de código</h3>
<ul>
<li>Como produzir esse código C?
<ul>
<li>Vamos criar funções para produzir a expressão.</li>
<li>Usar um &ldquo;template&rdquo; do corpo do código C.</li>

</ul></li>

</ul>
</section>
<section id="slide-orge5ccf41">
<h3 id="orge5ccf41">Geração de código</h3>
<ul>
<li>Como produzir o texto da expressão a partir da AST?
<ul>
<li>Essa é a operação inversa da análise sintática</li>
<li>Normalmente conhecida como pretty-print</li>

</ul></li>

</ul>
</section>
<section id="slide-org9cb9e01">
<h3 id="org9cb9e01">Geração de código</h3>
<ul>
<li>Para isso, vamos utilizar uma biblioteca Haskell para facilitar essa tarefa.</li>

<li>Para construir o pretty-print, vamos seguir a estrutura da gramática. 
<ul>
<li>Vantagem: evita parêntesis desnecessários.</li>

</ul></li>

</ul>
</section>
<section id="slide-org8517dcc">
<h3 id="org8517dcc">Geração de código</h3>
<ul>
<li><p>
Gramática
</p>

<div>
\begin{array}{lcl}
  E & \to & T + E\,|\,T\\
  T & \to & F * T\,|\,F\\
  F & \to & n \,|\, (E)\\
\end{array}

</div></li>

</ul>
</section>
<section id="slide-org1bc771c">
<h3 id="org1bc771c">Geração de código</h3>
<ul>
<li>Primeiro nível do pretty-print</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">pprAdd</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">L0</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Doc</span>
<span style="color: #c678dd;">pprAdd</span> (<span style="color: #ECBE7B;">LAdd</span> e1 e2)
  <span style="color: #dcaeea;">=</span> hsep [pprAdd e1, text <span style="color: #98be65;">"+"</span>, pprAdd e2]
<span style="color: #c678dd;">pprAdd</span> other <span style="color: #dcaeea;">=</span> pprMul other 
</pre>
</div>
</section>
<section id="slide-orgb14df35">
<h3 id="orgb14df35">Geração de código</h3>
<ul>
<li>Segundo nível do pretty-print</li>

</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">pprMul</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">L0</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Doc</span> 
<span style="color: #c678dd;">pprMul</span> (<span style="color: #ECBE7B;">LMul</span> e1 e2) 
  <span style="color: #dcaeea;">=</span> hsep [pprMul e1, text <span style="color: #98be65;">"*"</span>, pprMul e2]
<span style="color: #c678dd;">pprMul</span> other <span style="color: #dcaeea;">=</span> pprFact other 
</pre>
</div>
</section>
