slides/aula01/aula01.tex
\subsection*{Análise sintática}
\label{sec:orgc339211}

\begin{itemize}
\item Função top-level do analisador sintático
\end{itemize}

\begin{verbatim}
l0Parser :: [Token] -> Either String L0 
l0Parser tks 
  = case runParser expParser tks of 
      ((t, []) : _) -> Right t 
      _             -> Left "Parse error on program."
\end{verbatim}
\section*{Intepretador}
\label{sec:orgdfe22cc}

\subsection*{Interpretador}
\label{sec:orgde9cec1}

\begin{itemize}
\item De posse de um analisador sintático, podemos agora:
\begin{itemize}
\item Executar o código (interpretador)
\item Gerar código (compilador)
\end{itemize}
\end{itemize}
\subsection*{Interpretador}
\label{sec:org7bc21e2}

\begin{itemize}
\item Intepretador:
\end{itemize}

\begin{verbatim}
eval :: L0 -> Either String Value 
eval (LVal v) = Right v 
eval (LAdd l1 l2) 
  = do 
       v1 <- eval l1 
       v2 <- eval l2 
       v1 .+. v2 
eval (LMul l1 l2) 
  = do 
       v1 <- eval l1
       v2 <- eval l2 
       v1 .*. v2
\end{verbatim}
\subsection*{Interpretador}
\label{sec:org9a0cae1}

\begin{itemize}
\item Operações sobre valores.
\end{itemize}

\begin{verbatim}
(.+.) :: Value -> Value -> Either String Value 
(VInt n1) .+. (VInt n2) = Right (VInt (n1 + n2))
e1 .+. e2 = Left $ unwords ["Type error on:", pretty e1, "+", pretty e2] 
\end{verbatim}
\section*{Geração de código}
\label{sec:org3764367}

\subsection*{Geração de código}
\label{sec:org15ab5cd}

\begin{itemize}
\item Vamos agora considerar o problema de gerar código. 
\begin{itemize}
\item Para uma máquina virtual
\item Executável, gerando código fonte C, e usar o gcc para produzir o executável.
\end{itemize}
\end{itemize}
\subsection*{Geração de código}
\label{sec:orgfae5f2c}

\begin{itemize}
\item Gerar o código C correspondente consiste em:
\begin{itemize}
\item Produzir o código com uma função main.
\item Corpo da função possui uma variável que recebe o resultado da expressão.
\item Imprime o valor da variável usando printf.
\end{itemize}
\end{itemize}
\subsection*{Geração de código}
\label{sec:orgb5f508a}

\begin{itemize}
\item Exemplo:
\begin{itemize}
\item Considere a expressão: (1 + 2) * 3
\end{itemize}
\end{itemize}

\begin{verbatim}
#include <stdio.h>
// code generated for expressions
int main () {
   int val = (1 + 2) * 3;
   printf("%d", val);
   putchar('\n');
   return 0;
}
\end{verbatim}
\subsection*{Geração de código}
\label{sec:org537b220}

\begin{itemize}
\item Como produzir esse código C?
\begin{itemize}
\item Vamos criar funções para produzir a expressão.
\item Usar um ``template'' do corpo do código C.
\end{itemize}
\end{itemize}
\subsection*{Geração de código}
\label{sec:org7f639f8}

\begin{itemize}
\item Como produzir o texto da expressão a partir da AST?
\begin{itemize}
\item Essa é a operação inversa da análise sintática
\item Normalmente conhecida como pretty-print
\end{itemize}
\end{itemize}
\subsection*{Geração de código}
\label{sec:orga041f70}

\begin{itemize}
\item Para isso, vamos utilizar uma biblioteca Haskell para facilitar essa tarefa.

\item Para construir o pretty-print, vamos seguir a estrutura da gramática. 
\begin{itemize}
\item Vantagem: evita parêntesis desnecessários.
\end{itemize}
\end{itemize}
\subsection*{Geração de código}
\label{sec:org39d3c3c}

\begin{itemize}
\item Gramática

\begin{array}{lcl}
  E & \to & T + E\,|\,T\\
  T & \to & F * T\,|\,F\\
  F & \to & n \,|\, (E)\\
\end{array}
\end{itemize}
\subsection*{Geração de código}
\label{sec:org899f6e1}

\begin{itemize}
\item Primeiro nível do pretty-print
\end{itemize}

\begin{verbatim}
pprAdd :: L0 -> Doc
pprAdd (LAdd e1 e2)
  = hsep [pprAdd e1, text "+", pprAdd e2]
pprAdd other = pprMul other 
\end{verbatim}
\subsection*{Geração de código}
\label{sec:org0aa2566}

\begin{itemize}
\item Segundo nível do pretty-print
\end{itemize}

\begin{verbatim}
pprMul :: L0 -> Doc 
pprMul (LMul e1 e2) 
  = hsep [pprMul e1, text "*", pprMul e2]
pprMul other = pprFact other 
\end{verbatim}
