slides/aula01/aula01.org
** Geração de código 

- Último nível do pretty-print 

#+begin_src haskell 
pprFact :: L0 -> Doc
pprFact (LVal v) = ppr v 
pprFact other = parens (ppr other)
#+end_src

** Geração de código 

- Gerando o corpo do código C. 

#+begin_src haskell 
cL0Codegen :: L0 -> String 
cL0Codegen e 
  = unlines $ [ "#include <stdio.h>"
              , "// code generated for expressions"
              , "int main () {" ] ++
              (map (nest 3) (generateBody e)) ++
              [ nest 3 $ "putchar('\\n');"
              , nest 3 "return 0;"
              , "}"
              ] 
    where
      nest n v = replicate n ' ' ++ v
#+end_src 

* Máquina virtual 

** Máquina virtual 

- Agora vamos considerar a geração de código para uma máquina virtual simples, chamada de V0.


** Máquina virtual 

- Instruções:
  - Push(n): empilha um valor.
  - Add: desempilha dois valores e empilha a sua soma. 
  - Mul: desempilha dois valores e empilha o seu produto.
  * Print: desempilha um valor e o imprime no console. 
  * Halt: termina a execução. 

** Máquina virtual

- Execução de uma instrução, modifica a pilha da máquina.

** Máquina virtual 

- Executando uma instrução 

#+begin_src haskell 
step :: Instr -> Stack -> IO (Either String Stack)
step (Push v) stk = pure (Right (v : stk))
step Add (v1 : v2 : stk)
  = case v1 .+. v2 of 
      Left err -> pure (Left err)
      Right v3 -> pure (Right (v3 : stk))
step Print (v : stk)
  = do 
      print (pretty v)
      pure (Right stk) 
#+end_src 

** Máquina virtual 

- Executando uma lista de instruções.

#+begin_src haskell 
interp :: Code -> Stack -> IO () 
interp [] _ = pure ()
interp (c : cs) stk 
  = do 
      r <- step c stk
      case r of 
        Right stk' -> interp cs stk'
        Left err -> putStrLn err 
#+end_src 

** Máquina virtual 

- Compilando uma expressão 

#+begin_src haskell 
codegen' :: L0 -> Code 
codegen' (LVal v) = [Push v]
codegen' (LAdd l0 l1) 
  = codegen' l0 ++ codegen' l1 ++ [Add]
codegen' (LMul l0 l1) 
  = codegen' l0 ++ codegen' l1 ++ [Mul]
#+end_src 

** Máquina virtual 

- Compilando uma expressão 

#+begin_src haskell
v0Codegen :: L0 -> Code 
v0Codegen e = codegen' e ++ [Print, Halt]
#+end_src 

* Conclusão

** Conclusão

- Nesta aula, apresentamos uma implementação para expressões de:
  - Intepretador.
  - Compilador, usando o GCC
  - Compilador para uma máquina virtual.

* Tarefa

** Tarefa

- Primeira tarefa: obter o ambiente de execução e realizar testes com o código de exemplo.
