slides/aula01/aula01.tex
\subsection*{Geração de código}
\label{sec:orgac7dd1d}

\begin{itemize}
\item Último nível do pretty-print
\end{itemize}

\begin{verbatim}
pprFact :: L0 -> Doc
pprFact (LVal v) = ppr v 
pprFact other = parens (ppr other)
\end{verbatim}
\subsection*{Geração de código}
\label{sec:org44e0011}

\begin{itemize}
\item Gerando o corpo do código C.
\end{itemize}

\begin{verbatim}
cL0Codegen :: L0 -> String 
cL0Codegen e 
  = unlines $ [ "#include <stdio.h>"
              , "// code generated for expressions"
              , "int main () {" ] ++
              (map (nest 3) (generateBody e)) ++
              [ nest 3 $ "putchar('\\n');"
              , nest 3 "return 0;"
              , "}"
              ] 
    where
      nest n v = replicate n ' ' ++ v
\end{verbatim}
\section*{Máquina virtual}
\label{sec:org3b3e97d}

\subsection*{Máquina virtual}
\label{sec:org6266fb4}

\begin{itemize}
\item Agora vamos considerar a geração de código para uma máquina virtual simples, chamada de V0.
\end{itemize}
\subsection*{Máquina virtual}
\label{sec:orgc179b63}

\begin{itemize}
\item Instruções:
\begin{itemize}
\item Push(n): empilha um valor.
\item Add: desempilha dois valores e empilha a sua soma.
\item Mul: desempilha dois valores e empilha o seu produto.
\item Print: desempilha um valor e o imprime no console.
\item Halt: termina a execução.
\end{itemize}
\end{itemize}
\subsection*{Máquina virtual}
\label{sec:orgec367df}

\begin{itemize}
\item Execução de uma instrução, modifica a pilha da máquina.
\end{itemize}
\subsection*{Máquina virtual}
\label{sec:org6f3b4de}

\begin{itemize}
\item Executando uma instrução
\end{itemize}

\begin{verbatim}
step :: Instr -> Stack -> IO (Either String Stack)
step (Push v) stk = pure (Right (v : stk))
step Add (v1 : v2 : stk)
  = case v1 .+. v2 of 
      Left err -> pure (Left err)
      Right v3 -> pure (Right (v3 : stk))
step Print (v : stk)
  = do 
      print (pretty v)
      pure (Right stk) 
\end{verbatim}
\subsection*{Máquina virtual}
\label{sec:orgcbf07a1}

\begin{itemize}
\item Executando uma lista de instruções.
\end{itemize}

\begin{verbatim}
interp :: Code -> Stack -> IO () 
interp [] _ = pure ()
interp (c : cs) stk 
  = do 
      r <- step c stk
      case r of 
        Right stk' -> interp cs stk'
        Left err -> putStrLn err 
\end{verbatim}
\subsection*{Máquina virtual}
\label{sec:orgb936bea}

\begin{itemize}
\item Compilando uma expressão
\end{itemize}

\begin{verbatim}
codegen' :: L0 -> Code 
codegen' (LVal v) = [Push v]
codegen' (LAdd l0 l1) 
  = codegen' l0 ++ codegen' l1 ++ [Add]
codegen' (LMul l0 l1) 
  = codegen' l0 ++ codegen' l1 ++ [Mul]
\end{verbatim}
\subsection*{Máquina virtual}
\label{sec:orgd55511a}

\begin{itemize}
\item Compilando uma expressão
\end{itemize}

\begin{verbatim}
v0Codegen :: L0 -> Code 
v0Codegen e = codegen' e ++ [Print, Halt]
\end{verbatim}
\section*{Conclusão}
\label{sec:org607c88f}

\subsection*{Conclusão}
\label{sec:org5983d65}

\begin{itemize}
\item Nesta aula, apresentamos uma implementação para expressões de:
\begin{itemize}
\item Intepretador.
\item Compilador, usando o GCC
\item Compilador para uma máquina virtual.
\end{itemize}
\end{itemize}
\section*{Tarefa}
\label{sec:org7fb5c4a}

\subsection*{Tarefa}
\label{sec:org20a67d0}

\begin{itemize}
\item Primeira tarefa: obter o ambiente de execução e realizar testes com o código de exemplo.
\end{itemize}
\end{document}
